DROP DATABASE IF EXISTS library;

CREATE DATABASE library;

USE library;

CREATE TABLE books (
  id int(11) NOT NULL AUTO_INCREMENT,
  code int(11) NOT NULL,
  is_new boolean DEFAULT 1,
  name varchar(255) NOT NULL,
  price float DEFAULT NULL,
  publisher varchar(255) NOT NULL,
  pages int(11) NOT NULL,
  format varchar(50)  DEFAULT NULL ,
  published_at date DEFAULT NULL,
  circulation int(11) NOT NULL,
  topic varchar(255) NOT NULL,
  category varchar(255) NOT NULL,
  PRIMARY KEY (id)
);

CREATE INDEX idx_books_publisher ON books(publisher);
CREATE INDEX idx_books_format ON books(format);
CREATE INDEX idx_books_category ON books(category);

INSERT INTO books (`code`, `is_new`, `name`, `price`, `publisher`, `pages`, `format`, `published_at`, `circulation`, `topic`, `category`) VALUES
(5110, 1, 'Апаратні засоби мультимедіа.Відеосистема PC', 15.51, 'Видавнича група BHV', 400, '70х100/16', '2000-07-24', 5000, 'Використання ПК в цілому', 'Підручники'),
(4985, 1, 'Засвой самостійно модернізацію та ремонт ПК за 24 години, 2-ге вид', 18.9, 'Вiльямс', 288, '70х100/16', '2000-07-07', 5000, 'Використання ПК в цілому', 'Підручники'),
(5141, 1, 'Структури даних та алгоритми', 37.8, 'Вільямс', 384, '70х100/16', '2000-09-29', 5000, 'Використання ПК в цілому', 'Підручники'),
(5127, 1, 'Автоматизація інженерно-графічних робіт', 11.58, 'Видавнича група BHV ', 256, '70х100/16', '2000-06-15', 5000, 'Використання ПК в цілому', 'Підручники'),
(5113, 1, 'Апаратні засоби мультимедіа. Відеосистема РС', 15.51, 'Видавнича група BHV', 400, '70х100/16', '2000-07-24', 5000, 'Використання ПК в цілому', 'Апаратні засоби ПК'),
(5199, 1, 'Залізо IBM 2001 ', 30.07, 'МикроАрт', 368, '70х100/16', '2000-02-12', 5000, 'Використання ПК в цілому', 'Апаратні засоби ПК'),
(3851, 1, 'Захист інформації та безпека компютерних систем', 26, 'DiaSoft', 480, '84х108/16', '1900-01-01', 5000, 'Використання ПК в цілому', 'Захист і безпека ПК'),
(3932, 1, 'Як перетворити персональний компютер на вимірювальний комплексс', 7.65, 'ДМК', 144, '60х88/16', '2000-06-09', 5000, 'Використання ПК в цілому', 'Інші книги'),
(4713, 1, 'Plug-ins. Додаткові програми для музичних програм', 11.41, 'ДМК', 144, '70х100/16', '2000-02-22', 5000, 'Використання ПК в цілому', 'Інші книги'),
(5217, 1, 'Windows МЕ. Найновіші версії програм', 16.57, 'Триумф', 320, '70х100/16', '2000-08-25', 5000, 'Операційні системи', 'Windows 2000'),
(4829, 1, 'Windows 2000 Professional крок за кроком з CD', 27.25, 'Эком', 320, '70х100/16', '2000-04-28', 5000, 'Операційні системи', 'Windows 2000'),
(5170, 1, 'Linux версії', 24.43, 'ДМК', 346, '70х100/16', '2000-09-29', 5000, 'Операційні системи', 'Linux'),
(860, 1, 'Операційна система UNIX', 3.5, 'Видавнича група BHV', 395, '84х10016', '1997-05-05', 5000, 'Операційні системи', 'Unix'),
(44, 1, 'Відповіді на актуальні запитання щодо OS/2 Warp', 5, 'DiaSoft', 352, '60х84/16', '1996-03-20', 5000, 'Операційні системи', 'Інші операційні системи'),
(5176, 1, 'Windows Ме. Супутник користувача', 12.79, 'Видавнича група BHV', 306, '', '2000-10-10', 5000, 'Операційні системи', 'Інші операційні системи'),
(5462, 1, 'Мова програмування С++. Лекції та вправи ', 29, 'DiaSoft', 656, '84х108/16', '2000-12-12', 5000, 'Програмування', 'C&C++'),
(4982, 1, 'Мова програмування С. Лекції та вправи', 29, 'DiaSoft', 432, '84х108/16', '2000-12-07', 5000, 'Програмування', 'C&C++'),
(4687, 1, 'Ефективне використання C++ .50 рекомендацій щодо покращення ваших програм та проектів ', 17.6, 'ДМК', 240, '70х100/16', '2000-03-02', 5000, 'Програмування', 'C&C++'),
(235, 1, 'Інформаційні системи і структури даних', null, 'Києво-Могилянська академія', 288, '60х90/16', null, 400, 'Використання ПК в цілому', 'Інші книги'),
(8746, 0, 'Бази даних в інформаційних системах', null, 'Університет \"Україна\"', 418, '60х84/16', '2018-07-25', 100, 'Програмування', 'SQL'),
(2154, 0, 'Сервер на основі операційної системи FreeBSD 6.1', 0, 'Університет \"Україна\"', 216, '60х84/16', '2015-11-03', 500, 'Програмування ', 'Інші операційні системи'),
(2662, 1, 'Організація баз даних та знань', 0, 'Вінниця: ВДТУ', 208, '60х90/16', '2001-10-10', 1000, 'Програмування', ' SQL'),
(5641, 0, 'Організація баз даних та знань', 0, 'Видавнича група BHV', 384, '70х100/16', '2021-12-15', 5000, 'Програмування ', 'SQL');

ALTER TABLE books ADD author varchar(15);

ALTER TABLE books MODIFY COLUMN author varchar(25);

ALTER TABLE books DROP COLUMN author;

DROP INDEX idx_books_publisher ON books;
CREATE INDEX idx_books_publisher ON books(publisher DESC);